tutorials/incompressible/simpleSolver/ras/pitzDailyExptInlet/system/fvSolution
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  SSGS;
        tolerance       1e-06;
        relTol          0.01;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  USGS;
        tolerance       1e-05;
        relTol          0.1;
    }

    k
    {
        solver          PBiCGStab;
        preconditioner  USGS;
        tolerance       1e-05;
        relTol          0.1;
    }

    epsilon
    {
        solver          PBiCGStab;
        preconditioner  USGS;
        tolerance       1e-05;
        relTol          0.1;
    }

    R
    {
        solver          PBiCGStab;
        preconditioner  USGS;
        tolerance       1e-05;
        relTol          0.1;
    }

    nuTilda
    {
        solver          PBiCGStab;
        preconditioner  USGS;
        tolerance       1e-05;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;

    residualControl
    {
        p               1e-2;
        U               1e-3;
        "(k|epsilon|omega)" 1e-3;
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        k               0.7;
        epsilon         0.7;
        R               0.7;
        nuTilda         0.7;
    }
}


// ************************************************************************* //
